test_cases/airFoil2D_Re3e6_Ma0.3_alpha0/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Setting referred to https://github.com/AndreWeiner/naca0012_shock_buffet

// Rotates a vector by alpha in counter-clockwise direction (around the z-axis)
// https://en.wikipedia.org/wiki/Rotation_matrix
// Ufree is the free stream velocity vector at zero angle of attack
alpha         0.0; // Angle of attack in degrees
Ufree         (102.963 0.0 0.0); // Ma = 0.3, Re = 3.0e6 when the speed of sound c = 343.21 m/s

// Not to be changed
alpha         #eval{ degToRad($alpha) };
cos_alpha     #eval{ cos($alpha) };
sin_alpha     #eval{ sin($alpha) };
neg_sin_alpha #eval{ - $sin_alpha };
rot_matrix    ($cos_alpha $neg_sin_alpha 0.0 $sin_alpha $cos_alpha 0.0 0.0 0.0 1.0);
Uinlet        #eval{ $[(tensor)rot_matrix] & $[(vector)Ufree] };

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform $Uinlet;

boundaryField
{
    inlet
    {
        type            freestreamVelocity;
        freestreamValue uniform $Uinlet;
    }

    outlet
    {
        type            freestreamVelocity;
        freestreamValue uniform $Uinlet;
    }

    airfoil
    {
        type            noSlip;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
    
    processor
    {
        type  processor;
        value $internalField;
    }
}


// ************************************************************************* //
